import { textType } from 'processes/types'

export const BE: textType = {
  footer: {
    info: 'Арганізацыя не мае ніякага дачынення да Mojang AB. Усе правы на гульню належаць Mojang AB. Увесь астатні кантэнт належыць SpectruMTeam.',
    button: {
      contact: 'Кантакты',
      pay: 'Спосабы аплаты',
      teamsuccess: 'Карыстальніцкая дамова',
    },
  },
  main: {
    header: {
      hello: 'Сардэчна запрашаем на',
      info: 'Адчуйце лямпавую і прыязную атмасферу, дзе ўсе гульцы адчуваюць сябе як дома',
    },
    aboutproject: {
      block1: {
        head: 'Пра праект',
        first:
          "Нашы сервера Minecraft з'яўляюцца ўнікальнымі і непаўторнымі. Яны стабільныя і не змяшчаюць П2В (платныя перавагі).",
        second:
          'На нашых серверах вы зможаце выпрабаваць новыя гульнявыя рэжымы, унікальныя міні-гульні і падзеі, якія не знойдзеце нідзе яшчэ.',
        third:
          'Нашыя адміністратары і мадэратары працуюць над тым, каб зрабіць гульню на нашых серверах максімальна прыемнай і бяспечнай для ўсіх гульцоў. Калі ў вас узнікнуць якія-небудзь пытанні ці праблемы, не саромейцеся звяртацца да нас за дапамогай. Мы заўсёды радыя дапамагчы.',
        fourth:
          'Мы імкнемся да таго, каб нашы серверы былі цікавымі і разнастайнымі, каб заўсёды было чым заняцца.',
        fifth:
          'Мы таксама стараемся даць нашым гульцам справядлівую гульню без пераваг для гульцоў, якія плацяць грошы.',
        sixth:
          'Вы зможаце правесці свой час на нашых серверах, ведаючы, што ўсе гульцы маюць роўныя шансы. Мы таксама рэгулярна абнаўляем нашы серверы, каб вы заўсёды гулялі на самай апошняй версіі Minecraft.',
      },
      block2: {
        info: "Адчуйце лямпавую і прыязную атмасферу, дзе ўсе гульцы адчуваюць сябе як дома. Мы распрацавалі спецыяльныя функцыі і падзеі, каб палепшыць узаемадзеянне паміж гульцамі і стварыць утульную атмасферу. Мы таксама імкнемся стварыць супольнасць, якая з'яўляецца адкрытым і ветлівым да ўсіх новых гульцоў.",
      },
      block3: {
        info: 'Наши администраторы и модераторы всегда рады помочь новичкам и ответить на любые вопросы, у которых могут возникнуть. Мы надеемся, что вы почувствуете себя как дома на наших серверах и станете частью нашего уютного сообщества. Ждем вас на наших серверах!',
      },
      cardpay: {
        headpay: 'Кошт доступу на Хардкор',
        button: 'Набыць доступ на сервер',
      },
    },
  },
  menu: {
    home: 'Галоўная',
    hardcore: 'Хардкор',
    auth: 'Аўтарызацыя',
    profile: 'Профіль',
    theme: 'Тэма',
  },
  profile: {
    head: 'Профіль',
    setting: {
      headbutton: 'Налады',
      nickname: 'Нікнэйм',
      email: 'Пошта',
      changepass: {
        head: 'Змена пароля',
        input: 'Новы пароль',
        button: 'Пацвердзіць',
      },
      admin: {
        head: 'Адмін панэль',
        button: 'Перайсці',
      },
      exit: 'Выйсці з акаўнта',
    },
    hardcore: {
      headbutton: 'Хардкор',
      head: 'Статыстыка',
      block1: {
        info1: 'Прыкладны час адраджэнне пасля смерці',
        info2: 'Дата апошняй смерці',
        info3: 'Прычына апошняй смерці',
      },
      block2: {
        head: 'Смерцяў',
      },
    },
  },
  hardcore: {
    abouthardcore: {
      about: 'Аб серверы',
      vanilla: 'Ванільны геймплэй, мінімальная колькасць плагінаў для камфортнай гульні',
      hardcore: 'Толькі хардкор! Плаціце за сваю смерць часам патрачаным на серверы',
      smp: 'Прасцей кажучы звычайнае выжыванне і ніякіх патуранняў',
    },
    workhradcore: {
      how: 'Як працуе Hardcore рэжым',
      maintext:
        'Калі вы прашараваны гулец у Minecraft, тыя вы ведаеце што рэжым Hardcore працуе па прынцыпе адной смерці. Аднак на серверы гэтая механіка вельмі марнатраўная, т.я. па неасцярожнасці можна страціць не толькі прагрэс, але і магчымасць гуляць з сябрамі. Таму мы зрабілі плягін які дасць магчымасць адрадзіцца праз час, які вы правялі на серверы',
      note: 'Для таго, каб дакладна разлічыць час адраджэння, мы карыстаемся формулай: час да адраджэння = бягучы час (на момант смерці) + час на серверы (толькі ў рэжыме выжывання)',
    },
    checkserver: {
      head: 'Івэнты, лёгкая зборка, і іншае...',
      info: "Сервер на Paper, прыязнае кам'юніці, цалкам бясплатнае карыстанне, Discord сервер, і іншыя плюшкі. Рэгіструйся і заходзь на сервер!",
      or: 'ці',
      button1: 'Скапіяваць IP адрас',
      button2: 'Перайсці ў асабісты кабінет',
    },
  },
  auth: {
    login: {
      head: 'Аўтарызацыя',
      login: 'Лагін',
      pass: 'Пароль',
      successbutton: 'Пацвердзіць',
      noacc: 'Нет аккаунта ?',
      register: 'Регистрация',
    },
    registration: {
      head: 'Рэгістрацыя',
      login: 'Лагін',
      email: 'Пошта',
      pass: 'Пароль',
      successbutton: 'Пацвердзіць',
      haveacc: 'Ужо зарэгістраваны?',
      signup: 'Увайсці',
    },
  },
  admin: {
    menu: {
      head: 'Адмін меню',
      users: 'Карыстальнікі',
      exit: 'Выйсці',
      button: {
        theme: 'Тэма',
        users: 'Карыстальнікі',
        lang: 'Мова',
      },
    },
    userpage: {
      head: 'Спіс карыстальнікаў',
      search: 'Пошук',
      card: {
        email: 'Пошта',
        about: 'Больш падрабязна',
        ban: {
          ban: 'Забаніць',
          noban: 'Разбаніць',
        },
        del: 'Выдаліць',
      },
    },
    usercard: {
      cardmodal: {
        ban: {
          ban: 'Вы ўпэўненыя, што жадаеце забаніць карыстальніка?',
          noban: 'Вы ўпэўненыя, што жадаеце разбаніць карыстальніка?',
          button1: 'Не',
          button2: 'Так',
        },
        change: {
          info: 'Змяненне дадзеных карыстальніка',
          email: 'Пошта',
          login: 'Нікнэйм',
          button1: 'Закрыць',
          button2: 'Змяніць',
        },
        del: {
          info: 'Вы ўпэўненыя, што жадаеце выдаліць карыстальніка?',
          button1: 'Не',
          button2: 'Так',
        },
      },
      model: {
        head: '3д мадэль',
      },
      info: {
        head: 'Асноўная інфармацыя',
        email: 'Пошта',
        nickname: 'Нікнэйм',
        role: 'Ролі',
        buttonchange: 'Змяніць',
        buttonban: {
          ban: 'Забаніць',
          noban: 'Разбаніць',
        },
        buttondel: 'Выдаліць',
      },
      statistic: {
        head: 'Статыстыка',
      },
      bag: {
        head: 'Інвентар',
      },
      response: {
        head: 'Запыты',
      },
    },
  },
  teamsuccess: {
    block1: {
      head: 'Карыстальніцкая дамова',
      text1: 'Карыстальнік, гулец - Фізічная асоба выкарыстоўвае праект.',
      text2: 'Праект - Уся платформа, уключаючы сайт, гульнявыя сервера, лаўнчар і да т.п.',
    },
    block2: {
      head: '1. Карыстальніцкая дамова:',
      '1': "Гэты дакумент з'яўляецца афіцыйным рэгламентам праекта, любыя іншыя такімі называцца не могуць.",
      '2': 'Мэта дадзеных правілаў - абарона інтарэсаў карыстальнікаў і рэсурсу і ўстанаўленне парадку на ўсіх рэсурсах праекта.',
      '3': 'Любы чалавек мае права наведваць праект, калі ён не парушае Правілы праекту.',
      '4': 'Рэгіструючыся на праекце, вы згаджаецеся з усімі правіламі дадзенага спісу, правамі апісанымі ніжэй і абавязкамі.',
      '5': 'Рэгіструючыся на праекце, вы згаджаецеся з апрацоўкай Адміністрацыяй вашых персанальных дадзеных, гэта значыць здзяйсненне, у тым ліку, наступных дзеянняў: апрацоўку (уключаючы збор, сістэматызацыю, назапашванне, захоўванне, удакладненне (абнаўленне, змена), выкарыстанне, абязлічванне, блакаванне, знішчэнне персанальных дадзеных дадзеных).',
      '6': 'Права выкарыстання ўсіх сэрвісаў праекта, прадастаўляецца Адміністрацыяй на бясплатнай аснове, за выключэннем дадатковых функцый (якія набываюцца на платнай аснове і актывуюцца шляхам актывацыі дадатковых магчымасцяў у сервернай версіі (убудовы) гульні), а таксама платных пропускаў на платныя серверы. Выкарыстанне бясплатнага функцыяналу даецца ў бягучай форме, не гарантуючы 100% правільнасць працы. Гульнявыя рэчы, здольнасці і да т.п., страчаныя ў сувязі з неналежнай працай неаплатных сэрвісаў, не вяртаюцца.',
      '7': 'Аплата дадатковых частак праграмнага прадукта ажыццяўляецца толькі на афіцыйным сайце праекта, які знаходзіцца па адрасе spectrumine.com у валюце - расійскі рубель. Залічэнне сродкаў робіцца з дапамогай агрэгатара плацяжоў у любой валюце па месцы знаходжання карыстальніка, якая канвертуецца самім агрэгатарам у расійскія рублі.',
      '8': 'Пры ўводзе на сайце не дакладнага ніка адміністрацыя не адказвае за наступствы пакупкі чаго-небудзь на гэты нік.',
      '9': 'Бо не заўсёды атрымоўваецца вызначыць парушэнне правіл карыстачом, канчатковае рашэнне застаецца за Адміністратарамі праекту.',
      '10': "Праваўладальнікамі дадатковых частак прадукта з'яўляюцца іх аўтары. Выкарыстанне гэтых частак Адміністрацыяй ажыццяўляецца на аснове пагаднення аб свабодным распаўсюджванні і выкарыстанні.",
      '11': 'Няведанне Правілаў не вызваляе ад адказнасці.',
      '12': 'Праект ніяк не злучаны з кампаніяй Mojang AB. Усе правы на гульню належаць Mojang AB.',
      '13': "Усе грошы, якія паступаюць ад гульцоў на бок платформы, з'яўляюцца бязвыплатным ахвяраваннем на развіццё сэрвісу і вяртанню не падлягаюць.",
    },
    block3: {
      head: '2. Правы і абавязкі гульцоў:',
      '1': 'Гулец мае права выкарыстоўваць усе даступныя яму магчымасці, калі яны не парушаюць Правілы праекту.',
      '2': 'Гулец цалкам адказвае за надзейнасць свайго пароля і доступу да акаўнта.',
      '3': 'Гулец мае права на добраахвотнае ахвяраванне.',
      '4': 'Гулец згаджаецца з тым, што выдаткаваныя ім сродкі не будуць вернуты.',
      '5': 'Гульцы, якія маюць розныя прывілеі на серверы, нічым не адрозніваюцца ад звычайных гульцоў, акрамя дадатковых касметычных магчымасцяў і цалкам падпарадкоўваюцца Правілам праекту а таксама EULA кампаніі Mojang AB.',
      '6': 'Гулец абавязаны паведамляць аб выяўленых багах і недапрацоўках Адміністрацыі сервера, у выпадку наўмыснага ўтойвання выяўленых багаў і недапрацовак, Адміністрацыя мае права заблакаваць або цалкам выдаліць акаўнт гульца.',
      '7': 'Любы гулец можа пажаліцца на іншых гульцоў.',
      '8': 'Гулец мае права падаць скаргу на гульца/мадэратара.',
    },
    block4: {
      head: '3. Правы і абавязкі Мадэрацыі (Персанал праекта):',
      '1': "Мадэратар з'яўляецца кіраўніцтвам праекту і ўключае ў сябе мадэрацыю і падтрымку.",
      '2': 'Мадэратар абавязаны выконваць Сапраўдныя Правілы.',
      '3': 'Мадэратар абавязаны адказваць на вусныя пытанні гульцоў (акрамя асабістых (дапамажы пабудаваць дом і г.д)), а таксама сачыць за выкананнем гэтых Правілаў.',
      '4': 'Мадэратар мае права выдаваць пакаранне зыходзячы з гэтых Правілаў.',
      '5': 'Пры выдачы пакарання, Мадэратар абавязаны ўказаць прычыну і нумар правіла.',
      '6': 'Мадэрацыі забаронена выдаваць пакаранне, калі яго няма ў правілах.',
      '7': 'Мадэратару забаронена выдаваць сябе за стваральніка, і распальваць розніцу ў бок Адміністрацыі.',
      '8': 'Дзеянні Мадэратара, накіраваныя на ўзбуджэнне нянавісці або варожасці, а таксама на прыніжэнне годнасці чалавека або групы асоб па прыкметах полу, расы, нацыянальнасці, мовы, паходжання, арыентацыі, адносіны да рэлігіі, а таксама прыналежнасці да якой-небудзь сацыяльнай групы, учыненыя публічна, - караецца здыманнем з пасады.',
    },
    block5: {
      head: '4. Правы і абавязкі Адміністрацыі:',
      '1': 'Адміністрацыя праекта можа ў выключных выпадках можа адхіляцца ад гэтых Правілаў і дзейнічаць на сваё меркаванне.',
      '2': 'Адміністрацыя не захоўвае паролі карыстальнікаў у адкрытым выглядзе.',
      '3': 'Адміністрацыя не нясе адказнасці за акаўнты гульцоў, у тым ліку сацыяльную інжынерыю, вірусы, падбор пароля і да т.п.',
      '4': 'Рашэнні Адміністрацыі абскарджанню не падлягаюць.',
      '5': 'Адміністрацыя мае права выдаваць любое пакаранне.',
      '6': 'Скаргі на Адміністрацыю не прымаюцца.',
      '7': "Усе атрыманыя Адміністрацыяй сродкі, з'яўляюцца добраахвотным ахвяраваннем і вяртанню не падлягаюць (п. 2.4).",
      '8': 'Адміністрацыя мае права забіраць прывілеі і адмаўляць у абслугоўванні гульцам без тлумачэння прычыны.',
      '9': 'Адміністрацыя мае права змяняць магчымасці гульнявых прывілеяў як у лепшы, так і ў горшы бок, без якіх-небудзь апавяшчэнняў.',
      '10': 'Тлумачэнне правіл сайта ажыццяўляецца толькі галоўнымі Адміністратарамі. Любыя іншыя спробы вытлумачыць правілы на карысць любога з бакоў прызнаюцца некарэктнымі.',
      '11': 'Адміністрацыя мае права не тлумачыць прычыны блакіроўкі акаўнтаў.',
      '12': 'Адміністрацыя пакідае за сабой права ў аднабаковым парадку змяняць бягучыя правілы з апавяшчэннем карыстальнікаў з дапамогай афіцыйнай супольнасці праекту, што знаходзіцца на рэсурсе "УКантакце".',
      '13': 'Адміністрацыя вядзе кіраванне гульнявымі працэсамі і ўсім праектам - выключна па сваім меркаванні.',
      '14': "Адміністрацыя пакідае за сабой права праводзіць перыядычныя абнаўленні гульнявога міру і ўсіх статыстык (вайп). Вайп вырабляюцца Адміністрацыяй па заканчэнні часавага адрэзка, далей якога нармальнае функцыянаванне сэрвісаў немагчыма, з прычыны асаблівасцяў пабудовы гульнявога працэсу. Працягласць вышэйпаказанага часовага адрэзка вызначаецца адміністрацыяй самастойна, зыходзячы з бягучага стану спраў. Вайп не з'яўляецца адмовай карыстачу ў выкарыстанні платных дадаткаў, бо пры гэтым не адбываецца водгук ліцэнзіі на частку праграмнага прадукта ці абмежаванні функцыяналу гэтай часткі.",
      '15': 'Адміністрацыя мае права трымаць сваю асобу ў ананімнасці. З-за гэтага маюць права не адказваць на вашыя пытанні, якія не адносяцца да сервера.',
    },
  },
  confirmation: {
    load: 'Чаканне пацверджання...',
  },
  error: {
    notifyError: {
      error: 'Невядомая памылка',
      usernameNotExistsInMojang: 'Імя карыстальніка не існуе ў Mojang',
      tooManyRegRequests: 'Занадта шмат запытаў',
      userWithSameUsernameOrEmailExists: 'Карыстальнік з такім нікнеймам ці поштай ужо існуе',
      form: {
        'mail.notMail': 'Такой пошты няма',
        'username.empty': 'Нікнэйм пусты',
        'username.incorrect': 'Увядзіце карэктна нікнэйм',
        'password.tooShort': 'Пароль занадта кароткі',
        'password.incorrect': 'Увядзіце карэктна пароль',
      },
    },
    notifyChangeError: {
      error: 'Невядомая памылка',
      userWithSameEmailNotExists: 'Карыстальніка з такой поштай не існуе',
      tooManyChangePassRequests: 'Занадта шмат запытаў',
      incorrectForm: 'Некарэктная форма адпраўкі',
    },
    notifyConfirmationError: {
      error: 'Невядомая памылка',
      userWithSameUsernameOrEmailExists: 'Карыстальнік з такім нікнеймам ці поштай ужо існуе',
      invalideCode: 'Час для пацверджання скончыўся',
    },
    notifyLoginError: {
      error: 'Невядомая памылка',
      userWithSameUsernameOrEmailNotExists: 'Карыстальнік з такім лагінам ці поштай не знойдзены',
      form: 'Увядзіце правільна лагін або пароль',
      incorrectPassword: 'Няправільны пароль',
    },
    getUserError: {
      error: 'Невядомая памылка',
    },
    notifyConfirmationPassError: {
      error: 'Невядомая памылка',
      userNotFound: 'Карыстальнік не знойдзены',
      tokenExpired: 'Час для пацверджання скончыўся',
    },
    notifyConfirmationRolesError: {
      error: 'Невядомая памылка',
      notAllowed: 'Не знойдзена',
    },
  },
}
