import { textType } from 'processes/types'

export const UK: textType = {
  footer: {
    info: 'Організація не має жодного відношення до Mojang AB. Усі права на гру належать Mojang AB. Весь решта контенту належить SpectruMTeam.',
    button: {
      contact: 'Контакти',
      pay: 'Способи оплати',
      teamsuccess: 'Користувача угода',
    },
  },
  main: {
    header: {
      hello: 'Ласкаво просимо на',
      info: 'Відчуйте лампову та доброзичливу атмосферу, де всі гравці почуваються як удома',
    },
    aboutproject: {
      block1: {
        head: 'Про проект',
        first:
          'Наші сервери Minecraft є унікальними та неповторними. Вони стабільні та не містять П2В (платні переваги).',
        second:
          'На наших серверах ви зможете випробувати нові ігрові режими, унікальні міні-ігри та події, які не знайдете ніде ще.',
        third:
          'Наші адміністратори та модератори працюють над тим, щоб зробити гру на наших серверах максимально приємною та безпечною для всіх гравців. Якщо у вас виникнуть питання або проблеми, не соромтеся звертатися до нас за допомогою. Ми завжди раді допомогти.',
        fourth:
          'Ми прагнемо того, щоб наші сервери були цікавими та різноманітними, щоб завжди було чим зайнятися.',
        fifth:
          'Ми також намагаємось надати нашим гравцям справедливу гру без переваг для гравців, які сплачують гроші.',
        sixth:
          'Ви зможете провести свій час на наших серверах, знаючи, що усі гравці мають рівні шанси. Ми також регулярно оновлюємо наші сервери, щоб ви завжди грали на останній версії Minecraft.',
      },
      block2: {
        info: 'Відчуйте лампову та доброзичливу атмосферу, де всі гравці почуваються як удома. Ми розробили спеціальні функції та події, щоб покращити взаємодію між гравцями та створити затишну атмосферу. Ми також прагнемо створити спільноту, яка є відкритою та привітною до всіх нових гравців.',
      },
      block3: {
        info: 'Наші адміністратори та модератори завжди раді допомогти новачкам та відповісти на будь-які питання, у яких можуть виникнути. Ми сподіваємося, що ви відчуєте себе як вдома на наших серверах і станете частиною нашої затишної спільноти. Чекаємо на вас на наших серверах!',
      },
      cardpay: {
        headpay: 'Вартість доступу на Хардкор',
        button: 'Придбати доступ на сервер',
      },
    },
  },
  menu: {
    home: 'Головна',
    hardcore: 'Хардкор',
    auth: 'Авторизація',
    profile: 'Профіль',
    theme: 'Тема',
  },
  profile: {
    head: 'Профіль',
    setting: {
      headbutton: 'Налаштування',
      nickname: 'Нікнейм',
      email: 'Пошта',
      changepass: {
        head: 'Зміна пароля',
        input: 'Новий пароль',
        button: 'Підтвердити',
      },
      admin: {
        head: 'Адмін панель',
        button: 'Перейти',
      },
      exit: 'Вийти',
    },
    hardcore: {
      headbutton: 'Хардкор',
      head: 'Статистика',
      block1: {
        info1: 'Приблизний час відродження після смерті',
        info2: 'Дата останньої смерті',
        info3: 'Причина останньої смерті',
        info4: 'Час на сервері',
        notdied: 'Не помер',
        notbeen: 'Не було на сервері',
      },
      block2: {
        head: 'Смерть',
      },
    },
  },
  hardcore: {
    abouthardcore: {
      about: 'Про сервер',
      vanilla: 'Ванільний геймплей, мінімальна кількість плагінів для комфортної гри',
      hardcore: 'Тільки хардкор! Платіть за свою смерть часом витраченим на сервері',
      smp: 'Простіше кажучи звичайне виживання і ніяких поблажок',
    },
    workhradcore: {
      how: 'Як працює Hardcore режим',
      maintext:
        'Якщо ви прошарений гравець у Minecraft, то ви знаєте що режим Hardcore працює за принципом однієї смерті. Однак на сервері ця механіка дуже марнотратна, т.к. з необережності можна втратити як прогрес, а й можливість грати з друзями. Тому ми зробили плагін, який дасть можливість відродитися через час, який ви провели на сервері.',
      note: 'Для того, щоб точно розрахувати час відродження, ми користуємося формулою: час до відродження = час (на момент смерті) + час на сервері (тільки в режимі виживання)',
    },
    checkserver: {
      head: 'Івенти, легке складання, та інше.',
      info: "Сервер на Paper, доброзичливе ком'юніті, повністю безкоштовне користування, Discord сервер та інші плюшки. Реєструйся та заходь на сервер!",
      or: 'або',
      button1: 'Копіювати IP адресу',
      button2: 'Перейти до особистого кабінету',
    },
  },
  auth: {
    login: {
      head: 'Авторизація',
      login: 'Логін',
      pass: 'Пароль',
      successbutton: 'Підтвердити',
      noacc: 'Немає облікового запису?',
      register: 'Реєстрація',
    },
    registration: {
      head: 'Реєстрація',
      login: 'Логін',
      email: 'Пошта',
      pass: 'Пароль',
      successbutton: 'Підтвердити',
      haveacc: 'Вже зареєстровані?',
      signup: 'Увійти',
    },
  },
  admin: {
    menu: {
      head: 'Адмін меню',
      users: 'Користувачі',
      exit: 'Вийти',
      button: {
        theme: 'Тема',
        users: 'Користувачі',
        lang: 'Мова',
      },
    },
    userpage: {
      head: 'Список користувачів',
      search: 'Пошук',
      card: {
        email: 'Пошта',
        about: 'Детальніше',
        ban: {
          ban: 'Забанити',
          noban: 'Розбанити',
        },
        del: 'Видалити',
      },
    },
    usercard: {
      cardmodal: {
        ban: {
          ban: 'Ви впевнені що хочете забанити користувача?',
          noban: 'Ви впевнені що хочете розбанити користувача?',
          button1: 'Ні',
          button2: 'Так',
        },
        change: {
          info: 'Зміна даних користувача',
          email: 'Пошта',
          login: 'Нікнейм',
          button1: 'Закрити',
          button2: 'Змінити',
        },
        del: {
          info: 'Ви впевнені що хочете видалити користувача?',
          button1: 'Ні',
          button2: 'Так',
        },
      },
      model: {
        head: '3д модель',
      },
      info: {
        head: 'Основна інформація',
        email: 'Пошта',
        nickname: 'Нікнейм',
        role: 'Ролі',
        buttonchange: 'Змінити',
        buttonban: {
          ban: 'Забанити',
          noban: 'Розбанити',
        },
        buttondel: 'Видалити',
      },
      statistic: {
        head: 'Статистика',
      },
      bag: {
        head: 'Інвентар',
      },
      response: {
        head: 'Запити',
      },
    },
  },
  teamsuccess: {
    block1: {
      head: 'Користувача угода',
      text1: 'Користувач, гравець – Фізична особа, яка використовує проект.',
      text2: 'Проект – вся платформа, включаючи сайт, ігрові сервери, лаунчер тощо.',
    },
    block2: {
      head: '1. Угода користувача:',
      '1': 'Цей документ є офіційним регламентом проекту, будь-які інші такими називатися не можуть.',
      '2': 'Мета цих правил – захист інтересів користувачів та ресурсу та встановлення порядку на всіх ресурсах проекту.',
      '3': 'Будь-яка людина має право відвідувати проект, якщо вона не порушує Правила проекту.',
      '4': "Реєструючись на проекті, ви погоджуєтесь з усіма правилами цього списку, правами описаними нижче та обов'язками.",
      '5': 'Реєструючись на проекті, ви погоджуєтесь з обробкою Адміністрацією ваших персональних даних, тобто здійснення, в тому числі, таких дій: обробку (включаючи збір, систематизацію, накопичення, зберігання, уточнення (оновлення, зміна), використання, знеособлення, блокування, знищення персональних даних) даних).',
      '6': "Право використання всіх сервісів проекту, надається Адміністрацією на безоплатній основі, за винятком додаткових функцій (придбаних на платній основі та активованих шляхом активації додаткових можливостей у серверній версії (плагіни) гри), а також платних перепусток на платні сервери. Використання безкоштовного функціоналу надається у поточній формі, не гарантуючи 100% правильність роботи. Ігрові речі, здібності тощо, втрачені у зв'язку з неналежною роботою неоплачуваних сервісів, не повертаються.",
      '7': 'Оплата додаткових частин програмного продукту провадиться лише на офіційному сайті проекту, що знаходиться за адресою spectrumine.com у валюті – російський рубль. Зарахування коштів здійснюється за допомогою агрегатора платежів у будь-якій валюті за місцем знаходження користувача, що конвертується самим агрегатором у російські рублі.',
      '8': 'При введенні на сайті невірного ніка адміністрація не відповідає за наслідки купівлі чогось на цей нік.',
      '9': 'Оскільки завжди вдається визначити порушення правил користувачем, остаточне рішення залишається за Адміністраторами проекту.',
      '10': 'Правовласниками додаткових елементів продукту є автори. Використання цих частин Адміністрацією здійснюється на основі угоди про вільне поширення та використання.',
      '11': 'Незнання Правил не звільняє від відповідальності.',
      '12': "Проект ніяк не пов'язаний із компанією Mojang AB. Усі права на гру належать Mojang AB.",
      '13': 'Всі гроші, що надходять від гравців на бік платформи, є безоплатною пожертвою на розвиток сервісу і поверненню не підлягають.',
    },
    block3: {
      head: "2. Права та обов'язки гравців:",
      '1': 'Гравець має право використовувати всі доступні для нього можливості, якщо вони не порушують Правила проекту.',
      '2': 'Гравець повністю відповідає за надійність свого пароля та доступу до облікового запису.',
      '3': 'Гравець має право на добровільну пожертву.',
      '4': 'Гравець погоджується з тим, що витрачені ним кошти не буде повернено.',
      '5': 'Гравці, що мають різні привілеї на сервері, нічим не відрізняються від звичайних гравців, крім додаткових косметичних можливостей і повністю підкоряються Правил проекту та EULA компанії Mojang AB.',
      '6': "Гравець зобов'язаний повідомляти про виявлені баги та недоробки Адміністрації сервера, у разі навмисного приховування виявлених багів та недоробок, Адміністрація має право заблокувати або повністю видалити обліковий запис гравця.",
      '7': 'Будь-який гравець може поскаржитися на інших гравців.',
      '8': 'Гравець має право подати скаргу на гравця/модератора.',
    },
    block4: {
      head: "3. Права та обов'язки Модерації (Персонал проекту):",
      '1': 'Модератор є керівництвом проекту і включає модерацію і підтримку.',
      '2': "Модератор зобов'язаний дотримуватися цих Правил.",
      '3': "Модератор зобов'язаний відповідати на усні питання гравців (крім особистих (допоможи побудувати будинок тощо)), а також стежити за дотриманням цих Правил.",
      '4': 'Модератор має право видавати покарання виходячи з цих Правил.',
      '5': "При видачі покарання Модератор зобов'язаний вказати причину та номер правила.",
      '6': 'Модерації заборонено видавати покарання, якщо його немає в правилах.',
      '7': 'Модератору заборонено видавати себе за творця і розпалювати ворожнечу у бік Адміністрації.',
      '8': 'Дії Модератора, створені задля порушення ненависті чи ворожнечі, і навіть на приниження гідності людини чи групи осіб за ознаками статі, раси, національності, мови, походження, орієнтації, ставлення до релігії, і приналежності до будь-якої соціальної групі, вчинені публічно, - карається зняттям з посади.',
    },
    block5: {
      head: "4. Права та обов'язки Адміністрації:",
      '1': 'Адміністрація проекту може у виняткових випадках може відхилятися від цих Правил і діяти на власний розсуд.',
      '2': 'Адміністрація не зберігає паролі користувачів у відкритому вигляді.',
      '3': 'Адміністрація не несе відповідальності за облікові записи гравців, включаючи соціальну інженерію, віруси, підбір пароля тощо.',
      '4': 'Рішення Адміністрації не підлягають оскарженню.',
      '5': 'Адміністрація має право видавати будь-яке покарання.',
      '6': 'Скарги на Адміністрацію не приймаються.',
      '7': 'Усі отримані Адміністрацією кошти є добровільною пожертвою і поверненню не підлягають (п. 2.4).',
      '8': 'Адміністрація має право забирати привілеї та відмовляти в обслуговуванні гравцям без пояснення причини.',
      '9': 'Адміністрація має право змінювати можливості ігрових привілеїв як на кращу, так і на гіршу сторону, без будь-яких повідомлень.',
      '10': 'Тлумачення правил сайту здійснюється лише головними Адміністраторами. Будь-які інші спроби витлумачити правила на користь будь-якої зі сторін визнаються некоректними.',
      '11': 'Адміністрація має право не пояснювати причини блокування облікових записів.',
      '12': 'Адміністрація залишає за собою право в односторонньому порядку змінювати поточні правила з повідомленням користувачів через офіційну спільноту проекту, що знаходиться на ресурсі "ВКонтакте".',
      '13': 'Адміністрація веде управління ігровими процесами та всім проектом - виключно на свій розсуд.',
      '14': 'Адміністрація залишає за собою право проводити періодичні оновлення ігрового світу та всіх статистик (вайп). Вайп виробляються Адміністрацією після закінчення тимчасового відрізка, далі якого нормальне функціонування сервісів неможливе, через особливості побудови ігрового процесу. Тривалість вищезгаданого тимчасового відрізка визначається адміністрацією самостійно, виходячи з поточного стану справ. Вайп не є відмовою користувачу у використанні платних доповнень, тому при цьому не відбувається відкликання ліцензії на частину програмного продукту або обмеження функціоналу цієї частини.',
      '15': 'Адміністрація має право тримати свою особистість в анонімності. Через це мають право не відповідати на ваші запитання, які не належать до сервера.',
    },
  },
  confirmation: {
    load: 'Очікування підтвердження.',
  },
  errorpage: {
    text: {
      errorpage: 'Помилка 404: Ця сторінка не існує',
    },
    textinfo:
      'Просимо Вас, як користувача, і надалі бути уважнішими під час навігації сторінками нашого сайту, щоб не викликати низку будь-яких помилок. Нижче ви можете повернутися на наш веб-сайт.',
    button: 'Повернутися на сайт',
  },
  error: {
    notifyError: {
      error: 'Невідома помилка',
      usernameNotExistsInMojang: "Ім'я користувача не існує у Mojang",
      tooManyRegRequests: 'Забагато запитів',
      userWithSameUsernameOrEmailExists: 'Користувач із таким нікнеймом або поштою вже існує',
      form: {
        'mail.notMail': 'Такої пошти немає',
        'username.empty': 'Нікнейм порожній',
        'username.incorrect': 'Введіть коректно нікнейм',
        'password.tooShort': 'Пароль надто короткий',
        'password.incorrect': 'Введіть коректно пароль',
      },
    },
    notifyChangeError: {
      error: 'Невідома помилка',
      userWithSameEmailNotExists: 'Користувача з такою поштою не існує',
      tooManyChangePassRequests: 'Забагато запитів',
      incorrectForm: 'Некоректна форма відправлення',
    },
    notifyConfirmationError: {
      error: 'Невідома помилка',
      userWithSameUsernameOrEmailExists: 'Користувач із таким нікнеймом або поштою вже існує',
      invalideCode: 'Час для підтвердження закінчився',
    },
    notifyLoginError: {
      error: 'Невідома помилка',
      userWithSameUsernameOrEmailNotExists: 'Користувача з таким логіном або поштою не знайдено',
      form: 'Введіть правильно логін або пароль',
      incorrectPassword: 'Невірний пароль',
    },
    getUserError: {
      error: 'Невідома помилка',
    },
    notifyConfirmationPassError: {
      error: 'Невідома помилка',
      userNotFound: 'Користувача не знайдено',
      tokenExpired: 'Час для підтвердження закінчився',
    },
    notifyConfirmationRolesError: {
      error: 'Невідома помилка',
      notAllowed: 'Не знайдено',
    },
    errorFormLogin: {
      loginLength: 'Логін повинен містити не менше 3-х символів',
      passwordLength: 'Пароль повинен містити не менше 8-и символів',
    },
    errorFormSignUp: {
      nicknameError:
        'Нік повинен бути не менше 3-х символів, а також містити латинські букви або цифри',
      mailError: 'Введіть коректно пошту',
      passwordError:
        'Пароль повинен містити не менше 8-и символів, а також мати хоча б одну цифру і одну велику букву',
    },
    errorChangePassword: {
      change:
        'Пароль повинен містити не менше 8-и символів, а також мати хоча б одну цифру і одну велику букву',
    },
    errorHardcoreStat: {
      error: 'Невідома помилка',
      notFound: 'Не знайдено',
    },
  },
  accept: {
    account: 'Аккаунт активовано!',
    password: 'Пароль змінено!',
  },
  notification: {
    refetch: 'Немає підключення до сервера...',
    loading: 'Завантаження даних...',
    copy: 'Рядок скопійований',
  },
}
